adamj537/Code-Library/Processor_Peripherals/TI_MSP430FR5xx_6xx/I2CDriver.c
/******************************************************************************
 *
 *	Filename:		I2C.c (for TI's MSP430)
 *
 *	Author:			Adam Johnson
 *
 *	Description:	This is an I2C master transmitter module which uses
 *					interrupts.
 *
 *	Notes:		(1) External pull-ups are required...for some MSP's the GPIO's
 *					internal pull-ups aren't usable when in I2C mode.  Here's
 *					the schematic for the test function:
 *
 *					                     /|\  /|\
 *					    MSP430FR5869     10k  10k       Slave
 *					       master         |    |        Device
 *					  -----------------   |    |   -----------------
 *					-|XIN  P1.6/UCB0SDA|<-|----+->|SDA              |
 *					 |                 |  |       |                 |
 *					-|XOUT             |  |       |                 |
 *					 |     P1.7/UCB0SCL|<-+------>|SCL              |
 *					 |                 |          |                 |
 *
 *				(2) The acts of (1) reading from UCBxRXBUF, (2) setting UCTXSTT
 *					bit, and (2) setting UCTXSTP bit all cause new data to be
 *					clocked into UCBxRXBUF.  So before getting the last byte in
 *					a receive transaction, we disable the RX interrupt, do both
 *					actions, and then enable it again.  Otherwise we will lose
 *					the 2nd-to-last byte of data in the transaction.  We also
 *					need to do something similar when receiving only one byte.
 *
 *	Origin:			github.com/adamj537/Code-Library
 *
 *	Terms of Use:	MIT License
 *
 *****************************************************************************/

#include <stdint.h>
#include <driverlib.h>
#include "project.h"					// global settings
#include "hal_I2C.h"					// header for this module

/******************************************************************************
 * 	Configuration options
 *****************************************************************************/
#ifndef UART_CLOCK_FREQ_HZ
#warning "UART_CLOCK_FREQ_HZ is not defined"
#define UART_CLOCK_FREQ_HZ 	CS_getSMCLK()	// master clock frequency
#endif

#ifndef UART_CLOCK_SOURCE
#warning "UART_CLOCK_SOURCE is not defined"
#define UART_CLOCK_SOURCE	UCSSEL__SMCLK	// use main clock
#endif
/*****************************************************************************/

// USCI registers - the numbers are offsets from a "base address" defined in
// the handleToBaseAddress array below.
#define I2CREG_CTLW0		0x0000		// Control Word
#define I2CREG_CTL1			0x0000		// Control 1
#define I2CREG_CTL0			0x0001		// Control 0
#define I2CREG_BRW			0x0006		// Baud Rate Control Word
#define I2CREG_BR0			0x0006		// Baud Rate Control 0
#define I2CREG_BR1			0x0007		// Baud Rate Control 1
#define I2CREG_STAT			0x0008		// Status Register
#define I2CREG_RXBUF		0x000C		// Receive Buffer
#define I2CREG_TXBUF		0x000E		// Transmit Buffer
#define I2CREG_OA			0x0014		// I2C Own Address
#define I2CREG_SA			0x0020		// I2C Slave Address
#define I2CREG_ICTL			0x002A		// Interrupt Enable Register
#define I2CREG_IE			0x002A		// USCI Bx Interrupt Enable Register
#define I2CREG_IFG			0x002C		// USCI Bx Interrupt Flags Register
#define I2CREG_IV			0x002E		// Interrupt Vector Register

// Macros to help with register access.
#define REG16(x)			(*((volatile uint16_t *)((uint16_t)x)))
#define REG8(x)				(*((volatile uint8_t *)((uint16_t)x)))

// This array holds the address of the lowest register in each I2C peripheral.
// If we know that address and the "offset" of each register (defined above),
// then we can access any register of any I2C peripheral.
static const uint16_t baseAddr[] = {
#ifdef __MSP430_HAS_USCI_B0__			// USCI B0
	__MSP430_BASEADDRESS_USCI_B0__,
#endif

#ifdef __MSP430_HAS_USCI_B1__			// USCI B1
	__MSP430_BASEADDRESS_USCI_B1__,
#endif

#ifdef __MSP430_HAS_USCI_B2__			// USCI B2
	__MSP430_BASEADDRESS_USCI_B2__,
#endif

#ifdef __MSP430_HAS_USCI_B3__			// USCI B3
	__MSP430_BASEADDRESS_USCI_B3__,
#endif

#ifdef __MSP430_HAS_EUSCI_B0__			// eUSCI B0
	__MSP430_BASEADDRESS_EUSCI_B0__,
#endif

#ifdef __MSP430_HAS_EUSCI_A0__			// eUSCI A0
	__MSP430_BASEADDRESS_EUSCI_A0__,
#endif

#ifdef __MSP430_HAS_EUSCI_A1__			// eUSCI A1
	__MSP430_BASEADDRESS_EUSCI_A1__,
#endif
};

// Figure out how many channels we have available.
#define I2C_NUM_CHANNELS	(sizeof(baseAddr)/sizeof(baseAddr[0])

volatile uint8_t *txDataPtr[I2C_NUM_CHANNELS];	// pointer to TX data
volatile uint32_t txByteCtr[I2C_NUM_CHANNELS];	// number of bytes to TX

volatile uint8_t *rxDataPtr[I2C_NUM_CHANNELS];	// pointer to RX data
volatile uint32_t rxByteCtr[I2C_NUM_CHANNELS];	// number of bytes to RX

/******************************************************************************
 *
 *	Function:		I2CInit
 *
 *	Description:	Initializes the specified I2C with the provided settings.
 *
 *	Parameters:		uint8_t channel - which I2C peripheral to act upon
 *					i2cConfig_t *configPtr - settings to apply to the channel
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CInit(uint8_t channel, i2cConfig_t *configPtr)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value ;)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.
	uint16_t preScalarValue;

	// Reset global variables in case we were stuck somewhere.
	txByteCtr[channel] = 0;
	rxByteCtr[channel] = 0;

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	// Configure in slave mode if requested.
	else if ((configPtr->mode == I2C_MODE_SLAVE) ||
			(configPtr->mode == I2C_MODE_SLAVE_AND_GEN_CALL))
	{
		// Disable the USCI module and clear the other bits of control register.
		REG16(base + I2CREG_CTLW0) = UCSWRST;

		// Clear USCI master mode.
		REG16(base + I2CREG_CTLW0) &= ~UCMST;

		// Configure I2C as Slave and Synchronous mode.
		REG16(base + I2CREG_CTLW0) = UCMODE_3 | UCSYNC;

		// Set up the slave address.
//		REG16(base + I2CREG_OA) = configPtr->address;

		// Enable general call if requested.
		if (configPtr->mode == I2C_MODE_SLAVE_AND_GEN_CALL)
		{
			REG16(base + I2CREG_OA) |= UCGCEN;
		}
		else
		{
			REG16(base + I2CREG_OA) &= ~UCGCEN;
		}
	}

	// Configure in master (or multi-master) mode if requested.
	else
	{
		// Disable the USCI module and clear the other bits of control register.
		REG16(base + I2CREG_CTLW0) = UCSWRST;

