adamj537/Code-Library/Processor_Peripherals/TI_MSP430FR5xx_6xx/I2CDriver.c
		// Configure as I2C master mode.
		// UCMST = Master mode; UCMODE_3 = I2C mode; UCSYNC = Synchronous mode
		REG16(base + I2CREG_CTLW0) |= UCMST | UCMODE_3 | I2C_CLOCK_SOURCE;

		// If multi-master mode is selected, enable it.
		if (configPtr->mode == I2C_MODE_MULTI_MASTER)
		{
			REG16(base + I2CREG_CTLW0) |= UCMM;
		}
		else
		{
			REG16(base + I2CREG_CTLW0) &= ~UCMM;
		}

		// Compute the clock divider to give close to the desired speed.
		preScalarValue = (uint16_t)(I2C_CLOCK_FREQ_HZ / configPtr->speed);
		REG16(base + I2CREG_BRW) = preScalarValue;

		// Set the address we'll attempt to talk to.
//		REG8(base + I2CREG_SA) = configPtr->address;
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CEnable
 *
 *	Description:	Turns on the specified I2C channel.  This is separate from
 *					the init function so that the channel can be enabled and
 *					disabled without reconfiguring it.
 *
 *	Parameters:		uint8_t channel - which I2C peripheral to act upon
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CEnable(uint8_t channel)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}
	else
	{
		// Clear the UCSWRST bit to enable the I2C Module.
		REG16(base + I2CREG_CTLW0) &= ~(UCSWRST);

		// Enable transmit, receive, and not-acknowledge interrupts.
		REG8(base + I2CREG_IE) |= UCTXIE | UCRXIE | UCNACKIE;
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CDisable
 *
 *	Description:	Turns off the specified I2C channel.  The configuration
 *					specified in the init function will be preserved, so you
 *					don't need to redo the init function after calling this.
 *
 *	Parameters:		uint8_t channel - which I2C peripheral to act upon
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CDisable(uint8_t channel)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set the UCSWRST bit to disable the I2C Module.
		REG16(base + I2CREG_CTLW0) |= UCSWRST;

		// Disable transmit, receive, and not-acknowledge interrupts.
		REG8(base + I2CREG_IE) &= ~(UCTXIE | UCRXIE | UCNACKIE);
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CIsBusy
 *
 *	Description:	This function indicates whether or not the I2C bus is busy.
 *					It checks the status of the UCBBUSY bit in UCBxSTAT
 *					register.  If you call I2CRead or I2CWrite while the bus is
 *					busy, then both I2C transactions will be clobbered.
 *
 *	Parameters:		uint8_t channel - which I2C peripheral to act upon
 *
 *	Return Value:	TRUE if the I2C Master is busy; FALSE otherwise.
 *
 *****************************************************************************/

uint8_t I2CIsBusy (uint8_t channel)
{
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

    // Check the bus busy bit of the STAT register.
	if ((REG8(base + I2CREG_STAT) & UCBBUSY)	||
		(REG8(base + I2CREG_STAT) & UCSCLLOW)	||
		(REG8(base + I2CREG_CTL1) & UCTXSTP)	||
		(REG8(base + I2CREG_CTL1) & UCTXSTT)	||
		(REG8(base + I2CREG_IFG) & UCTXIFG)		||
		(REG8(base + I2CREG_IFG) & UCRXIFG))
	{
		return 1;
	}
	return 0;
}

/******************************************************************************
 *
 *	Function:		I2CWrite
 *
 *	Description:	Writes to an I2C slave device.
 *
 *	Parameters:		uint8_t channel - which I2C peripheral to act upon
 *					uint8_t address - I2C device address to use
 *					uint8_t *data - array of bytes to write to slave device
 *					uint32_t count - size of data array
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CWrite(uint8_t channel, uint8_t address, uint8_t *data, uint32_t count)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set TX array start address.
		txDataPtr[channel] = data;

		// Load TX byte counter.
		txByteCtr[channel] = count;

		// Indicate that we're not reading.
		rxByteCtr[channel] = 0;

		// Set the address we'll attempt to talk to.
		REG8(base + I2CREG_SA) = address;

		// Send START + address + WRITE.
		REG16(base + I2CREG_CTLW0) |= UCTXSTT | UCTR;

		// The rest of the message will be sent via ISR.
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CRead
 *
 *	Description:	Reads from an I2C slave device.
 *
 *	Parameters:		uint8_t channel - which I2C peripheral to act upon
 *					uint8_t address - I2C device address to use
 *					uint8_t *data - array to put data read from the device
 *					uint32_t count - size of data array
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CRead(uint8_t channel, uint8_t address, uint8_t *data, uint32_t count)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set the address we'll attempt to talk to.
		REG8(base + I2CREG_SA) = address;

