adamj537/Code-Library/Processor_Peripherals/TI_MSP430FR5xx_6xx/I2CDriver.c
		// Indicate that we're not writing.
		txByteCtr[channel] = 0;

		// Set RX array start address.
		rxDataPtr[channel] = data;

		// The case when we send only one byte is strange because of the way
		// the MSP430's I2C hardware state machine works...you have to send
		// START and STOP before you allow the interrupt to fire to get the
		// received byte.  This is similar to the case of the last byte of a
		// receive transaction (see Note 3 above).
		if (count == 1)
		{
			rxByteCtr[channel] = 0;

			// Disable receive interrupt.
			REG8(base + I2CREG_IE) &= ~UCRXIE;

			// Send START + address + READ.
			REG8(base + I2CREG_CTL1) &= ~UCTR;
			REG8(base + I2CREG_CTL1) |= UCTXSTT;

			// Wait for START to be sent.
			while (REG8(base + I2CREG_CTL1) & UCTXSTT);

			// Send STOP.
			REG8(base + I2CREG_CTL1) |= UCTXSTP;

			// Enable receive interrupt.
			REG8(base + I2CREG_IE) |= UCRXIE;
		}
		else if (count > 1)
		{
			// Set RX byte counter.  We subtract 1 because the I2C peripheral
			// reads the first byte after the START condition is sent, which is
			// before the ISR is called.  So by the time we get into the ISR
			// (which uses rxByteCtr), we've already got the first byte.  We
			// subtract another 1 because the ISR needs the rxByteCtr to be
			// 0-indexed.
			rxByteCtr[channel] = count - 2;

			// Send START + address + READ.
			REG8(base + I2CREG_CTL1) &= ~UCTR;
			REG8(base + I2CREG_CTL1) |= UCTXSTT;
		}
		else
		{
			return I2C_RESULT_INVALID_SELECTION;
		}

		// The rest of the message will be sent via ISR.
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CWriteThenRead
 *
 *	Description:	Writes to, and then reads from, an I2C devie.  This is a
 *					common practice, for example we may wish to read data from
 *					an I2C EEPROM, so we will write the location we wish to
 *					start reading from, and then read the data.
 *
 *	Parameters:		uint8_t channel - which I2C peripheral to act upon
 *					uint8_t address - I2C device address to use
 *					uint8_t *writeData - array of bytes to write to slave device
 *					uint32_t writeCount - size of data array
 *					uint8_t *readData - array to put data read from the device
 *					uint32_t readCount - size of data array
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CWriteThenRead(uint8_t channel, uint8_t address, uint8_t *writeData,
	uint32_t writeCount, uint8_t *readData, uint32_t readCount)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set the address we'll attempt to talk to.
		REG8(base + I2CREG_SA) = address;

		// Set TX array start address.
		txDataPtr[channel] = writeData;

		// Load TX byte counter.
		txByteCtr[channel] = writeCount;

		// Set RX array start address.
		rxDataPtr[channel] = readData;

		// Set RX byte counter.  Unlike in I2CRead, we don't subtract anything,
		// because we won't read any bytes until the ISR, and we need this to
		// be 1-indexed (for now).  It's tricky...you might want to step
		// through this operation with a debugger.
		rxByteCtr[channel] = readCount;

		// Send START + address + WRITE.
		REG8(base + I2CREG_CTL1) |= UCTXSTT | UCTR;

		// The rest of the message will be sent via ISR.
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CReadThenWrite
 *
 *	Description:	Writes to, and then reads from, an I2C device.  This is not
 *					common, but the author thought "why not?".
 *
 *	Parameters:		uint8_t channel - which I2C peripheral to act upon
 *					uint8_t address - I2C device address to use
 *					uint8_t *readData - array to put data read from the device
 *					uint32_t readCount - size of data array
 *					uint8_t *writeData - array of bytes to write to slave device
 *					uint32_t writeCount - size of data array
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CReadThenWrite(uint8_t channel, uint8_t address, uint8_t *readData,
		uint32_t readCount, uint8_t *writeData, uint32_t writeCount)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set the address we'll attempt to talk to.
		REG8(base + I2CREG_SA) = address;

		// Set TX array start address.
		txDataPtr[channel] = writeData;

		// Load TX byte counter.
		txByteCtr[channel] = writeCount;

		// Set RX array start address.
		rxDataPtr[channel] = readData;

		// Set RX byte counter.  We subtract 1 because the I2C peripheral reads
		// the first byte after the START condition is sent, which is before
		// the ISR is called.  So by the time we get into the ISR (which uses
		// rxByteCtr), we've already got the first byte.
		rxByteCtr[channel] = readCount - 1;

		// Send START + address + READ.
		REG8(base + I2CREG_CTL1) &= ~UCTR;
		REG8(base + I2CREG_CTL1) |= UCTXSTT;

		// The rest of the message will be sent via ISR.
	}
	return result;
}

/******************************************************************************
 *	Test Functions
 *****************************************************************************/

#ifdef INCLUDE_TESTS

#define I2C_ADDR	0x50

// First message:  Write to EEPROM.
const uint8_t writeMsg[] = {
	0x00,	// register to access
	0x00,	// value for register
	0x01,	// value for register
	0x02,	// value for register
	0x03,
	0x04,
	0x05,
};

// Second message:  Read from EEPROM.  This is for the "write-then-read" test.
const uint8_t readMsg[] = {
	0x00,	// EEPROM register to read from
};

uint8_t I2CTest(uint8_t channel)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	i2cConfig_t config;					// module config data
	volatile uint8_t response[16];		// bytes received from EEPROM

	do	// I'm afraid of goto statements, so I'll use this instead ;}
	{
		// Setup the I2C configuration.
		config.mode = I2C_MODE_MASTER;
		config.speed = 10000;
//		config.address = I2C_ADDR;

		// Initialize the I2C peripheral with the configuration.
		result = I2CInit(channel, &config);
		if (result != I2C_RESULT_OK)
			break;

		// Enable the I2C peripheral.
		result = I2CEnable(channel);
		if (result != I2C_RESULT_OK)
			break;

