adamj537/Code-Library/Processor_Peripherals/TI_MSP430FR5xx_6xx/I2CDriver.c
		// Try a read.
//		result = I2CRead(channel, I2C_ADDR, (uint8_t *)response, sizeof(response));
//		if (result != I2C_RESULT_OK)
//			break;

		// Wait until the device is not busy from the previous operation.
//		while (I2CIsBusy(channel));

		// Try a write.
//		result = I2CWrite(channel, I2C_ADDR, (uint8_t *)writeMsg, sizeof(writeMsg));
//		if (result != I2C_RESULT_OK)
//			break;

		// Wait until the device is not busy from the previous operation.
//		while (I2CIsBusy(channel));

		// Wait > 5 ms for the EEPROM to finish the write cycle (see
		// datasheet).  MCLK = 1048576 Hz (by default), so:
		// MCLK (1/s) * 0.005 s = 5242.88.  Round up to 5250, and wait that
		// many cycles.
//		__delay_cycles(5250);

		// Try a write-then-read.
//		result = I2CWriteThenRead(channel, I2C_ADDR, (uint8_t *)readMsg,
//			sizeof(readMsg), (uint8_t *)response, sizeof(response));
//		if (result != I2C_RESULT_OK)
//			break;

		// Wait until the device is not busy from the previous operation.
//		while (I2CIsBusy(channel));
	} while (false);

	return 0;
}

#endif	/* INCLUDE_TEST */

/******************************************************************************
 *
 *	Function:		I2C_ISR
 *
 *	Description:	This function is called by the interrupt handlers for this
 *					module.  It is structured such that it can be used to
 *					transmit any number of bytes by pre-loading a byte counter
 *					with the byte count, and doing some pointer math.  There
 *					are tricky things about how this hardware works, so	read
 *					Note 3 (above) to learn more.  Also, this function is
 *					declared as "inline" to speed up code execution in the ISR.
 *
 *	Parameters:		uint8_t ch - which I2C peripheral to act upon
 *					volatile uint16_t reg - interrupt vector address
 *
 *****************************************************************************/

static inline void I2C_ISR(uint8_t ch, volatile uint16_t reg)
{
	uint16_t base = baseAddr[ch];						// Convert channel to base address.

	switch(__even_in_range(reg, USCI_I2C_UCBIT9IFG))	// Find the interrupt's cause.
	{
	case USCI_NONE: break;								// Vector  0: No interrupts
	case USCI_I2C_UCALIFG: break;						// Vector  2: ALIFG
	case USCI_I2C_UCNACKIFG:							// Vector  4: NACKIFG
		REG8(base + I2CREG_CTL1) |= UCTXSTP;			// Send STOP.
		REG8(base + I2CREG_CTL1) &= ~UCNACKIFG;			// Clear no-ACK flag.
		break;
	case USCI_I2C_UCSTTIFG: break;						// Vector  6: STTIFG
	case USCI_I2C_UCSTPIFG: break;						// Vector  8: STPIFG
	case USCI_I2C_UCRXIFG3: break;						// Vector 10: RXIFG3
	case USCI_I2C_UCTXIFG3: break;						// Vector 12: TXIFG3
	case USCI_I2C_UCRXIFG2: break;						// Vector 14: RXIFG2
	case USCI_I2C_UCTXIFG2: break;						// Vector 16: TXIFG2
	case USCI_I2C_UCRXIFG1: break;						// Vector 18: RXIFG1
	case USCI_I2C_UCTXIFG1: break;						// Vector 20: TXIFG1
	case USCI_I2C_UCRXIFG0:								// Vector 22: RXIFG0
		if (rxByteCtr[ch])								// Check RX byte counter.
		{
			*rxDataPtr[ch] = REG8(base + I2CREG_RXBUF);	// Save received byte; fetch next byte.
			rxDataPtr[ch]++;							// Increment RX buffer pointer.
			rxByteCtr[ch]--;							// Decrement RX byte counter.
		}
		else if (txByteCtr[ch])							// Is this a read-then-write?
		{
			REG8(base + I2CREG_CTL1) |= UCTR;			// Set WRITE mode.
			REG8(base + I2CREG_CTL1) |= UCTXSTT;		// Send re-START.
		}
		else											// One byte left.
		{
			REG8(base + I2CREG_IE) &= ~UCRXIE;			// Disable RX interrupt (see Note 3).
			REG8(base + I2CREG_CTL1) |= UCTXSTP;		// Send STOP before last byte is read.
			*rxDataPtr[ch] = REG8(base + I2CREG_RXBUF);	// Save received byte; clear int flag.
			rxDataPtr[ch]++;							// Increment RX buffer pointer.
			REG8(base + I2CREG_IE) |= UCRXIE;			// Enable RX interrupt (see Note 3).
		}
		break;
	case USCI_I2C_UCTXIFG0:								// Vector 24: TXIFG0
		if (txByteCtr[ch])								// Check TX byte counter.
		{
			REG8(base + I2CREG_TXBUF) = *txDataPtr[ch];	// Load TX buffer.
			txDataPtr[ch]++;							// Increment TX buffer pointer.
			txByteCtr[ch]--;							// Decrement TX byte counter
		}
		else if (rxByteCtr[ch] == 1)					// Is this a (1-byte) write-then-read?
		{
			REG8(base + I2CREG_IE) &= ~UCRXIE;			// Disable RX interrupt (see Note 3).
			REG8(base + I2CREG_CTL1) &= ~UCTR;			// Set READ mode.
			REG8(base + I2CREG_CTL1) |= UCTXSTT;		// Send re-START (but don't fetch).
			while (REG8(base + I2CREG_CTL1) & UCTXSTT);	// Wait for START to be sent.
			REG8(base + I2CREG_CTL1) |= UCTXSTP;		// Send STOP.
			REG8(base + I2CREG_IE) |= UCRXIE;			// Enable RX interrupt (see Note 3).
			rxByteCtr[ch]--;							// Decrement RX byte counter.
		}
		else if (rxByteCtr[ch])							// Is this a write-then-read?
		{
			REG8(base + I2CREG_CTL1) &= ~UCTR;			// Set READ mode.
			REG8(base + I2CREG_CTL1) |= UCTXSTT;		// Send re-START (fetches 1st byte).
			rxByteCtr[ch] -= 2;							// Decrement RX byte counter by 2.
		}
		else											// We're done!
		{
			REG8(base + I2CREG_CTL1) |= UCTXSTP;		// Send STOP.
//			REG8(base + I2CREG_IFG) &= ~UCTXIFG;		// Clear int flag.
		}
		break;
	default: break;
	}
}

/******************************************************************************
 *
 * 	Function:		USCI_B0_ISR, USCI_B1_ISR, USCI_B2_ISR, USCI_B3_ISR
 *
 * 	Description:	These are interrupt service routines that are triggered by
 * 					USCI events.  It looks messy because of define statements
 * 					which format the code differently for different compilers.
 * 					It is also automatically not included if the processor
 * 					we're using does not have this module.
 *
 *****************************************************************************/

#if defined(__MSP430_HAS_USCI_B0__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B0_VECTOR
__interrupt void USCI_B0_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B0_VECTOR))) USCI_B0_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_0, UCB0IV);
}

#endif /* USCI B0 */

