adamj537/Code-Library/Processor_Peripherals/TI_MSP430FR5xx_6xx/I2CDriver.c
#if defined(__MSP430_HAS_USCI_B1__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B1_VECTOR
__interrupt void USCI_B1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B1_VECTOR))) USCI_B1_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_1, UCB1IV);
}

#endif /* USCI B1 */

#if defined(__MSP430_HAS_USCI_B2__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B2_VECTOR
__interrupt void USCI_B2_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B2_VECTOR))) USCI_B2_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_2, UCB2IV);
}

#endif /* USCI B2 */

#if defined(__MSP430_HAS_USCI_B3__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B3_VECTOR
__interrupt void USCI_B3_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B3_VECTOR))) USCI_B3_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_3, UCB3IV);
}

#endif /* USCI B3 */

#if defined(__MSP430_HAS_EUSCI_B0__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B0_VECTOR
__interrupt void USCI_B0_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B0_VECTOR))) USCI_B0_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_e0, UCB0IV);
}

#endif /* eUSCI B0 */

#if defined(__MSP430_HAS_EUSCI_A0__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_A0_VECTOR
__interrupt void USCI_A0_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_A0_VECTOR))) USCI_A0_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_e1, UCA0IV);
}

#endif /* eUSCI A0 */

#if defined(__MSP430_HAS_EUSCI_A1__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_A1_VECTOR
__interrupt void USCI_A1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_A1_VECTOR))) USCI_A1_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_e2, UCA1IV);
}

#endif /* eUSCI A1 */
